artifacts/oscar_e2e/fig4_right_qwen3_4b_thinking/vq2_s8/in100000_bs8/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31602, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=8, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=8, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31602/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31602, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-4B-Thinking-2507', served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=8, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=8, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_8_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 8         
Successful requests:                     8         
Benchmark duration (s):                  45.48     
Total input tokens:                      841288    
Total input text tokens:                 841288    
Total generated tokens:                  8000      
Total generated tokens (retokenized):    8000      
Request throughput (req/s):              0.18      
Input token throughput (tok/s):          18496.38  
Output token throughput (tok/s):         175.89    
Peak output token throughput (tok/s):    192.00    
Peak concurrent requests:                8         
Total token throughput (tok/s):          18672.26  
Concurrency:                             7.92      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   45048.92  
Median E2E Latency (ms):                 45151.61  
P90 E2E Latency (ms):                    45397.01  
P99 E2E Latency (ms):                    45447.92  
---------------Time to First Token----------------
Mean TTFT (ms):                          2498.71   
Median TTFT (ms):                        2671.88   
P99 TTFT (ms):                           2959.93   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.59     
Median TPOT (ms):                        42.55     
P99 TPOT (ms):                           43.43     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           42.59     
Median ITL (ms):                         42.83     
P95 ITL (ms):                            43.29     
P99 ITL (ms):                            43.61     
Max ITL (ms):                            1374.98   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:44<05:10, 44.41s/it]
 25%|██▌       | 2/8 [00:44<01:50, 18.44s/it]
 38%|███▊      | 3/8 [00:44<00:50, 10.12s/it]
 50%|█████     | 4/8 [00:45<00:24,  6.21s/it]
 62%|██████▎   | 5/8 [00:45<00:12,  4.02s/it]
 88%|████████▊ | 7/8 [00:45<00:02,  2.02s/it]
100%|██████████| 8/8 [00:45<00:00,  5.68s/it]